# Importação das libs

In [85]:
import pandas as pd
import openpyxl

## Importação dos dataframes

In [86]:
df_excel_estados = pd.read_excel('data/dados_aula1_estados_brasil.xlsx')

In [87]:
df_excel_aula = pd.read_csv('data/dados_aula1_pnad.csv', sep=';')

## Execução dos dataFrames

In [88]:
df_excel_estados

    IBGE               Estado  UF               Região  Qtd Mun
0     11             Rondônia  RO         Região Norte       52
1     12                 Acre  AC         Região Norte       22
2     13             Amazonas  AM         Região Norte       62
3     14              Roraima  RR         Região Norte       15
4     15                 Pará  PA         Região Norte      144
5     16                Amapá  AP         Região Norte       16
6     17            Tocantins  TO         Região Norte      139
7     21             Maranhão  MA      Região Nordeste      217
8     22                Piauí  PI      Região Nordeste      224
9     23                Ceará  CE      Região Nordeste      184
10    24  Rio Grande do Norte  RN      Região Nordeste      167
11    25              Paraíba  PB      Região Nordeste      223
12    26           Pernambuco  PE      Região Nordeste      185
13    27              Alagoas  AL      Região Nordeste      102
14    28              Sergipe  SE      Região Nordeste       75
15    29                Bahia  BA      Região Nordeste      417
16    31         Minas Gerais  MG       Região Sudeste      853
17    32       Espírito Santo  ES       Região Sudeste       78
18    33       Rio de Janeiro  RJ       Região Sudeste       92
19    35            São Paulo  SP       Região Sudeste      645
20    41               Paraná  PR           Região Sul      399
21    42       Santa Catarina  SC           Região Sul      295
22    43    Rio Grande do Sul  RS           Região Sul      497
23    50   Mato Grosso do Sul  MS  Região Centro-Oeste       79
24    51          Mato Grosso  MT  Região Centro-Oeste      141
25    52                Goiás  GO  Região Centro-Oeste      246
26    53     Distrito Federal  DF  Região Centro-Oeste        1

In [89]:
df_excel_aula.head(1)

   UF  Sexo  Cor  Anos de Estudo  Renda      Altura  nascimento
0  11     0    8              12    800  1603807616        1999

## criando o dataset por cor

In [90]:
data_cod = {'cod_cor':[0, 2, 4, 6 ,8], 'label_cor':['branco', 'preto', 'parda', 'amarela', 'indigena']}

In [91]:
df_cor = pd.DataFrame(data_cod)

In [92]:
df_cor

   cod_cor label_cor
0        0    branco
1        2     preto
2        4     parda
3        6   amarela
4        8  indigena

## renomeando os nomes das colunas df_excel_aula

In [93]:
df_excel_aula.rename(columns={"UF":'uf', "Sexo":'sexo', "Cor":'cod_cor',"Anos de Estudo":"tempo_estudo", 'Renda':"renda", "nascimento":"ano_nascimento"})

       uf  sexo  cod_cor  tempo_estudo  renda      Altura  ano_nascimento
0      11     0        8            12    800  1603807616            1999
1      11     1        2            12   1150  1739789827            1999
2      11     1        8            15    880  1760443822            1987
3      11     0        2             6   3500  1783157945            1976
4      11     1        8             9    150  1690630954            1975
...    ..   ...      ...           ...    ...         ...             ...
76835  53     1        2            11    812  1687030276            1976
76836  53     0        4             7   1500  1792933812            1992
76837  53     0        8            12   1300  1830587384            1990
76838  53     0        8             4   1500  1726344263            1965
76839  53     0        8             4    900  1658304846            1984

[76840 rows x 7 columns]

# 1) SELEÇÃO DE DADOS  SOMENTE FEATURES DE INTERESSE  - REMOÇÃO DE ALTURA

pegando somente o dado que interessa -> altura

In [94]:
df_excel_aula1 = df_excel_aula['Altura']
df_excel_aula1

0        1603807616
1        1739789827
2        1760443822
3        1783157945
4        1690630954
            ...
76835    1687030276
76836    1792933812
76837    1830587384
76838    1726344263
76839    1658304846
Name: Altura, Length: 76840, dtype: int64

removendo a coluna que não nos interessa ->

In [95]:
df_excel_aula2 = df_excel_aula.drop(columns=['Altura'])
df_excel_aula2

       UF  Sexo  Cor  Anos de Estudo  Renda  nascimento
0      11     0    8              12    800        1999
1      11     1    2              12   1150        1999
2      11     1    8              15    880        1987
3      11     0    2               6   3500        1976
4      11     1    8               9    150        1975
...    ..   ...  ...             ...    ...         ...
76835  53     1    2              11    812        1976
76836  53     0    4               7   1500        1992
76837  53     0    8              12   1300        1990
76838  53     0    8               4   1500        1965
76839  53     0    8               4    900        1984

[76840 rows x 6 columns]

# 2) INCLUIR IDADE

# --Como pegar ano atual para realizar cálculo

In [96]:
from datetime import date

In [97]:
data_atual = date.today()
data_atual = data_atual.year

In [98]:
df_excel_aula['Idade'] = data_atual - df_excel_aula['nascimento']

df_excel_aula['Idade'].describe()

count    76840.000000
mean        44.071421
std         12.480583
min         13.000000
25%         34.000000
50%         43.000000
75%         53.000000
max         99.000000
Name: Idade, dtype: float64

# 2)    IDADE  //Idade > 16 e Idade <= 75

# --CONSIDERAR IDADE > 16 E IDADE < 75

In [99]:
df_filtrado = df_excel_aula['Idade'][(16 <= df_excel_aula['Idade']) &  (75 > df_excel_aula['Idade'])]

df_filtrado.describe()

count    75947.000000
mean        43.669098
std         11.961069
min         16.000000
25%         34.000000
50%         43.000000
75%         52.000000
max         74.000000
Name: Idade, dtype: float64

# considerar renda > 0

In [100]:
df_excel_aula = df_excel_aula[(df_excel_aula['Renda'] > 0)]

df_excel_aula

       UF  Sexo  Cor  Anos de Estudo  Renda      Altura  nascimento  Idade
0      11     0    8              12    800  1603807616        1999     23
1      11     1    2              12   1150  1739789827        1999     23
2      11     1    8              15    880  1760443822        1987     35
3      11     0    2               6   3500  1783157945        1976     46
4      11     1    8               9    150  1690630954        1975     47
...    ..   ...  ...             ...    ...         ...         ...    ...
76835  53     1    2              11    812  1687030276        1976     46
76836  53     0    4               7   1500  1792933812        1992     30
76837  53     0    8              12   1300  1830587384        1990     32
76838  53     0    8               4   1500  1726344263        1965     57
76839  53     0    8               4    900  1658304846        1984     38

[73973 rows x 8 columns]

## juntando dataframes com o nome IBGE

In [101]:
df_excel_estados['IBGE']

0     11
1     12
2     13
3     14
4     15
5     16
6     17
7     21
8     22
9     23
10    24
11    25
12    26
13    27
14    28
15    29
16    31
17    32
18    33
19    35
20    41
21    42
22    43
23    50
24    51
25    52
26    53
Name: IBGE, dtype: int64

In [102]:
df_excel_aula = df_excel_aula.rename(columns={"UF":'IBGE', "Sexo":'sexo', "Cor":'cod_cor',"Anos de Estudo":"tempo_estudo", 'Renda':"renda", "nascimento":"ano_nascimento"})

In [103]:
new_df = pd.merge(df_excel_aula, df_excel_estados, how='outer', on='IBGE' )

new_df.head()

,IBGE,sexo,cod_cor,tempo_estudo,renda,Altura,ano_nascimento,Idade,Estado,UF,Região,Qtd Mun
0,11,0,8,12,800,1603807616,1999,23,Rondônia,RO,Região Norte,52
1,11,1,2,12,1150,1739789827,1999,23,Rondônia,RO,Região Norte,52
2,11,1,8,15,880,1760443822,1987,35,Rondônia,RO,Região Norte,52
3,11,0,2,6,3500,1783157945,1976,46,Rondônia,RO,Região Norte,52
4,11,1,8,9,150,1690630954,1975,47,Rondônia,RO,Região Norte,52

# Mudando a nomeclatura do Sexo

In [104]:
new_df.loc[new_df['sexo']==0, 'sexo']="M"
new_df.loc[new_df['sexo']==1, 'sexo']="F"
new_df.loc[new_df['sexo']==None, 'sexo']="D"

# FAIXA DE RENDA

In [153]:
new_df['faixa_salario'] = new_df['renda']

In [154]:
new_df.loc[(new_df.renda < 1000), 'faixa_salario'] = "Menor que 1000"
new_df.loc[(new_df.renda >= 1000) & (new_df.renda <1600), 'faixa_salario'] = "1000 |- 1600"
new_df.loc[(new_df.renda >= 1600) & (new_df.renda <4400), 'faixa_salario'] = "1600 |- 4400"
new_df.loc[(new_df.renda >= 4400) & (new_df.renda <5400), 'faixa_salario'] = "4400 |- 5400"
new_df.loc[(new_df.renda >= 5400), 'faixa_salario'] = "mais que 5400"

In [155]:
new_df['faixa_salario']

0        Menor que 1000
1          1000 |- 1600
2        Menor que 1000
3          1600 |- 4400
4        Menor que 1000
              ...
73968    Menor que 1000
73969      1000 |- 1600
73970      1000 |- 1600
73971      1000 |- 1600
73972    Menor que 1000
Name: faixa_salario, Length: 73973, dtype: object

faixa etaria

In [157]:
new_df['faixa_etaria'] = new_df['Idade']

In [162]:
new_df.loc[(new_df.Idade >= 16) & (new_df.Idade <= 24), 'faixa_etaria'] = "16 a 24"
new_df.loc[(new_df.Idade >= 25) & (new_df.Idade <= 34), 'faixa_etaria'] = "25 a 34"
new_df.loc[(new_df.Idade >= 35) & (new_df.Idade <= 44), 'faixa_etaria'] = "35 a 44"
new_df.loc[(new_df.Idade >= 45) & (new_df.Idade <= 54), 'faixa_etaria'] = "45 a 54"
new_df.loc[(new_df.Idade >= 55) & (new_df.Idade <= 64), 'faixa_etaria'] = "55 a 64"
new_df.loc[(new_df.Idade >= 65), 'faixa_etaria'] = "+65"

In [163]:
new_df['faixa_etaria']

0        16 a 24
1        16 a 24
2        35 a 44
3        45 a 54
4        45 a 54
          ...
73968    45 a 54
73969    25 a 34
73970    25 a 34
73971    55 a 64
73972    35 a 44
Name: faixa_etaria, Length: 73973, dtype: object

# CLASSE A,B,C...  ALGUNS DE EXEMPLO

In [167]:
salario_minimo = 1200
new_df['classe'] = 'NULL'

In [169]:
new_df.loc[(new_df.renda <= salario_minimo*2), 'classe'] = "E"
new_df.loc[(new_df.renda > salario_minimo*2) & (new_df.renda <= salario_minimo*4), 'classe'] = "D"
new_df.loc[(new_df.renda > salario_minimo*4) & (new_df.renda <= salario_minimo*10), 'classe'] = "C"
new_df.loc[(new_df.renda > salario_minimo*10) & (new_df.renda <= salario_minimo*20), 'classe'] = "B"
new_df.loc[(new_df.renda > salario_minimo*20), 'classe'] = "B"

In [170]:
new_df['classe']

0        E
1        E
2        E
3        D
4        E
        ..
73968    E
73969    E
73970    E
73971    E
73972    E
Name: classe, Length: 73973, dtype: object

# normalização
# IDADE NORMALIZADA

In [171]:
def normalizacao(x):
    return ((x-min(x))/(max(x)-min(x)))

In [172]:
new_df['idade_normalizada'] = normalizacao(new_df.Idade)

In [173]:
new_df['idade_normalizada']

0        0.121951
1        0.121951
2        0.268293
3        0.402439
4        0.414634
           ...
73968    0.402439
73969    0.207317
73970    0.231707
73971    0.536585
73972    0.304878
Name: idade_normalizada, Length: 73973, dtype: float64

In [174]:
new_df

,IBGE,sexo,cod_cor,tempo_estudo,renda,Altura,ano_nascimento,Idade,Estado,UF,Região,Qtd Mun,faixa_salario,faixa_etaria,classe,idade_normalizada
0,11,M,8,12,800,1603807616,1999,23,Rondônia,RO,Região Norte,52,Menor que 1000,16 a 24,E,0.121951
1,11,F,2,12,1150,1739789827,1999,23,Rondônia,RO,Região Norte,52,1000 |- 1600,16 a 24,E,0.121951
2,11,F,8,15,880,1760443822,1987,35,Rondônia,RO,Região Norte,52,Menor que 1000,35 a 44,E,0.268293
3,11,M,2,6,3500,1783157945,1976,46,Rondônia,RO,Região Norte,52,1600 |- 4400,45 a 54,D,0.402439
4,11,F,8,9,150,1690630954,1975,47,Rondônia,RO,Região Norte,52,Menor que 1000,45 a 54,E,0.414634
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73968,53,F,2,11,812,1687030276,1976,46,Distrito Federal,DF,Região Centro-Oeste,1,Menor que 1000,45 a 54,E,0.402439
73969,53,M,4,7,1500,1792933812,1992,30,Distrito Federal,DF,Região Centro-Oeste,1,1000 |- 1600,25 a 34,E,0.207317
73970,53,M,8,12,1300,1830587384,1990,32,Distrito Federal,DF,Região Centro-Oeste,1,1000 |- 1600,25 a 34,E,0.231707
73971,53,M,8,4,1500,1726344263,1965,57,Distrito Federal,DF,Região Centro-Oeste,1,1000 |- 1600,55 a 64,E,0.536585
73972,53,M,8,4,900,1658304846,1984,38,Distrito Federal,DF,Região Centro-Oeste,1,Menor que 1000,35 a 44,E,0.304878